// 1. В переменной хранится возраст пользователя. Ему может быть 0 лет 
let userAge;

// 2. Нужно отслеживать, авторизован ли пользователь на сайте.
let isAuthorized = false;

// 3. В переменной хранится список всех товаров в корзине интернет-магазина.
let myCart = [];

// 4. В переменной хранится информация о книге: её название, автор, год издания
// и количество страниц.
// Как назвать переменную для всей книги? А для свойств внутри неё?
let bookData = {
    name: "Maskarad",
    author: "Lermontov M. Y.",
    publicationDate: 1842,
    countPages: 448
};

// 5. В переменную записывается общая сумма всех товаров в корзине после применения всех скидок.
// Как назвать переменную?
let amountFinal = 0;

// 6. В переменной хранится ID таймера, который запускает какое-то действие каждые 5 секунд. 
// Эта переменная нужна, чтобы позже можно было этот таймер остановить.
// Как назвать переменную?
let timerStop = 0;

// 7. Нужно работать с кнопкой в интерфейсе, при нажатии на которую открывается модальное окно.
// Как назвать переменную, которая ссылается на эту HTML-кнопку?
let btnModal = 0;

// 8. Переменная отвечает на вопрос: "Отображен ли сейчас этот попап на экране?"
// Как назвать переменную?
let isPopupDisplay = 0;

// 10. Создаётся функция, которая будет вызвана при отправке пользователем формы регистрации.
// Как назвать эту функцию?
function FormSubmit() {

};
